diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_ЗапланированныеОтпуска/ВКМ_ЗапланированныеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ЗапланированныеОтпуска</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ДанныеОтпусков = Новый Массив;
	
	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
	
		Если Месяц(Отпуск.ДатаНачала) = Месяц(Отпуск.ДатаОкончания) Тогда
			ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(Отпуск.ДатаНачала),
																День(Отпуск.ДатаОкончания) - День(Отпуск.ДатаНачала));
			ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
		Иначе
			ДатаНачала = Отпуск.ДатаНачала;
			ДатаОкончания = Отпуск.ДатаОкончания;
			Пока Месяц(ДатаНачала) <> Месяц(ДатаОкончания) Цикл
				КонецМесяца = КонецМесяца(ДатаНачала);
				ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(ДатаНачала),
																	День(КонецМесяца) - День(ДатаНачала) + 1);
				ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
				ДатаНачала = КонецМесяца + 1;
			КонецЦикла;
			ИнформацияОбОтпуске = СформироватьИнформациюОбОтпуске(Отпуск.Сотрудник, Год(Год), Месяц(ДатаНачала),
																День(ДатаОкончания) - День(ДатаНачала));	
			ДанныеОтпусков.Добавить(ИнформацияОбОтпуске);
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
	
	Для Каждого Отпуск Из ДанныеОтпусков Цикл
	
		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Отпуск.Сотрудник;
		Движение.Год = Отпуск.Год;
		Движение.Месяц = Отпуск.Месяц;
		Движение.КоличествоДнейОтпуска = Отпуск.КоличествоДнейОтпуска;
			
	КонецЦикла;
	
	Движения.ВКМ_ЗапланированныеОтпуска.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьИнформациюОбОтпуске(Сотрудник, Год, Месяц, КоличествоДнейОтпуска, Доп = 0)
	
	ИнформацияОбОтпуске = Новый Структура;
	ИнформацияОбОтпуске.Вставить("Сотрудник", Сотрудник);
	ИнформацияОбОтпуске.Вставить("Год", Год);
	ИнформацияОбОтпуске.Вставить("Месяц", Месяц);
	ИнформацияОбОтпуске.Вставить("КоличествоДнейОтпуска", КоличествоДнейОтпуска);
	
	Возврат ИнформацияОбОтпуске;
		
КонецФункции

#КонецОбласти

#КонецЕсли
